pyocd/pyOCD/pyocd/debug/svd/data/LPC176x5x_v0.2.svd
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:30]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE2</name>																	
		<description>Pin mode select register 2</description>																	
		<addressOffset>0x048</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>P1_00MODE</name>															
				<description>Port 1 pin 0 control.</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P1.0 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P1.0 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P1.0 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P1.0 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_01MODE</name>															
				<description>Port 1 pin 1 control.</description>															
				<bitRange>[3:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P1.1 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P1.1 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P1.1 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P1.1 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[7:4]</bitRange>															
														
			</field>																
			<field>																
				<name>P1_04MODE</name>															
				<description>Port 1 pin 4 control.</description>															
				<bitRange>[9:8]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P1.4 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P1.4 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P1.4 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P1.4 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[15:10]</bitRange>															
														
			</field>																
			<field>																
				<name>P1_08MODE</name>															
				<description>Port 1 pin 8 control.</description>															
				<bitRange>[17:16]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P1.8 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P1.8 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P1.8 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P1.8 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_09MODE</name>															
				<description>Port 1 pin 9 control.</description>															
				<bitRange>[19:18]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P1.9 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P1.9 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P1.9 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P1.9 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_10MODE</name>															
				<description>Port 1 pin 10 control.</description>															
				<bitRange>[21:20]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P1.10 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P1.10 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P1.10 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P1.10 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[27:22]</bitRange>															
																			
														
