pyocd/pyOCD/pyocd/debug/svd/data/LPC176x5x_v0.2.svd
	<register>																		
		<name>PCONP</name>																	
		<description>Power Control for Peripherals Register</description>																	
		<addressOffset>0x0C4</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0x03BE</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[0:0]</bitRange>															
			</field>																
			<field>																
				<name>PCTIM0</name>															
				<description>Timer/Counter 0 power/clock control bit.</description>															
				<bitRange>[1:1]</bitRange>															
			</field>																
			<field>																
				<name>PCTIM1</name>															
				<description>Timer/Counter 1 power/clock control bit.</description>															
				<bitRange>[2:2]</bitRange>															
			</field>																
			<field>																
				<name>PCUART0</name>															
				<description>UART0 power/clock control bit.</description>															
				<bitRange>[3:3]</bitRange>															
			</field>																
			<field>																
				<name>PCUART1</name>															
				<description>UART1 power/clock control bit.</description>															
				<bitRange>[4:4]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[5:5]</bitRange>															
			</field>																
			<field>																
				<name>PCPWM1</name>															
				<description>PWM1 power/clock control bit.</description>															
				<bitRange>[6:6]</bitRange>															
			</field>																
			<field>																
				<name>PCI2C0</name>															
				<description>The I2C0 interface power/clock control bit.</description>															
				<bitRange>[7:7]</bitRange>															
			</field>																
			<field>																
				<name>PCSPI</name>															
				<description>The SPI interface power/clock control bit.</description>															
				<bitRange>[8:8]</bitRange>															
			</field>																
			<field>																
				<name>PCRTC</name>															
				<description>The RTC power/clock control bit.</description>															
				<bitRange>[9:9]</bitRange>															
			</field>																
			<field>																
				<name>PCSSP1</name>															
				<description>The SSP 1 interface power/clock control bit.</description>															
				<bitRange>[10:10]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[11:11]</bitRange>															
			</field>																
			<field>																
				<name>PCADC</name>															
				<description>A/D converter (ADC) power/clock control bit. Note: Clear the PDN bit in the AD0CR before clearing this bit, and set this bit before setting PDN.</description>															
				<bitRange>[12:12]</bitRange>															
			</field>																
			<field>																
				<name>PCCAN1</name>															
				<description>CAN Controller 1 power/clock control bit.</description>															
				<bitRange>[13:13]</bitRange>															
			</field>																
			<field>																
				<name>PCCAN2</name>															
				<description>CAN Controller 2 power/clock control bit.</description>															
				<bitRange>[14:14]</bitRange>															
			</field>																
			<field>																
				<name>PCGPIO</name>															
				<description>Power/clock control bit for IOCON, GPIO, and GPIO interrupts.</description>															
				<bitRange>[15:15]</bitRange>															
			</field>																
			<field>																
				<name>PCRIT</name>															
				<description>Repetitive Interrupt Timer power/clock control bit.</description>															
				<bitRange>[16:16]</bitRange>															
			</field>																
			<field>																
				<name>PCMCPWM</name>															
				<description>Motor Control PWM</description>															
				<bitRange>[17:17]</bitRange>															
			</field>																
			<field>																
				<name>PCQEI</name>															
				<description>Quadrature Encoder Interface power/clock control bit.</description>															
				<bitRange>[18:18]</bitRange>															
			</field>																
			<field>																
				<name>PCI2C1</name>															
				<description>The I2C1 interface power/clock control bit.</description>															
				<bitRange>[19:19]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[20:20]</bitRange>															
			</field>																
			<field>																
				<name>PCSSP0</name>															
				<description>The SSP0 interface power/clock control bit.</description>															
				<bitRange>[21:21]</bitRange>															
			</field>																
			<field>																
				<name>PCTIM2</name>															
				<description>Timer 2 power/clock control bit.</description>															
				<bitRange>[22:22]</bitRange>															
			</field>																
			<field>																
				<name>PCTIM3</name>															
				<description>Timer 3 power/clock control bit.</description>															
				<bitRange>[23:23]</bitRange>															
			</field>																
			<field>																
				<name>PCUART2</name>															
				<description>UART 2 power/clock control bit.</description>															
				<bitRange>[24:24]</bitRange>															
			</field>																
			<field>																
				<name>PCUART3</name>															
				<description>UART 3 power/clock control bit.</description>															
				<bitRange>[25:25]</bitRange>															
			</field>																
			<field>																
				<name>PCI2C2</name>															
				<description>I2C interface 2 power/clock control bit.</description>															
				<bitRange>[26:26]</bitRange>															
			</field>																
			<field>																
				<name>PCI2S</name>															
				<description>I2S interface power/clock control bit.</description>															
				<bitRange>[27:27]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[28:28]</bitRange>															
			</field>																
			<field>																
				<name>PCGPDMA</name>															
				<description>GPDMA function power/clock control bit.</description>															
				<bitRange>[29:29]</bitRange>															
			</field>																
			<field>																
				<name>PCENET</name>															
				<description>Ethernet block power/clock control bit.</description>															
				<bitRange>[30:30]</bitRange>															
			</field>																
			<field>																
				<name>PCUSB</name>															
				<description>USB interface power/clock control bit.</description>															
				<bitRange>[31:31]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>CCLKCFG</name>																	
		<description>CPU Clock Configuration Register</description>																	
		<addressOffset>0x104</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>CCLKSEL</name>															
				<description>Selects the divide value for creating the CPU clock (CCLK) from the PLL0 output. 0 = pllclk is divided by 1 to produce the CPU clock. This setting is not allowed when the PLL0 is connected, because the rate would always be greater than the maximum allowed CPU clock. 1 = pllclk is divided by 2 to produce the CPU clock. This setting is not allowed when the PLL0 is connected, because the rate would always be greater than the maximum allowed CPU clock. 2 = pllclk is divided by 3 to produce the CPU clock. 3 = pllclk is divided by 4 to produce the CPU clock. ... 255 = pllclk is divided by 256 to produce the CPU clock.</description>															
				<bitRange>[7:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:8]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>USBCLKCFG</name>																	
		<description>USB Clock Configuration Register</description>																	
		<addressOffset>0x108</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>USBSEL</name>															
				<description>Selects the divide value for creating the USB clock from the PLL0 output. Only the values shown below can produce even number multiples of 48 MHz from the PLL0 output.  Warning: Improper setting of this value will result in incorrect operation of the USB interface. 5 = PLL0 output is divided by 6. PLL0 output must be 288 MHz. 7 = PLL0 output is divided by 8. PLL0 output must be 384 MHz. 9 = PLL0 output is divided by 10. PLL0 output must be 480 MHz.</description>															
				<bitRange>[3:0]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:4]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>CLKSRCSEL</name>																	
		<description>Clock Source Select Register</description>																	
		<addressOffset>0x10C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>CLKSRC</name>															
				<description>Selects the clock source for PLL0 as follows. Warning: Improper setting of this value, or an incorrect sequence of changing this value may result in incorrect operation of the device.</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>SELECTS_THE_INTERNAL</name>													
						<description>Selects the Internal RC oscillator as the PLL0 clock source (default).</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SELECTS_THE_MAIN_OSC</name>													
						<description>Selects the main oscillator as the PLL0 clock source.  Select the main oscillator as PLL0 clock source if the PLL0 clock output is used for USB or for CAN with baudrates > 100 kBit/s.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SELECTS_THE_RTC_OSCI</name>													
						<description>Selects the RTC oscillator as the PLL0 clock source.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved, do not use this setting.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:2]</bitRange>															
															
