pyocd/pyOCD/pyocd/debug/svd/data/LPC176x5x_v0.2.svd
			</field>																
			<field>																
				<name>OSCRANGE</name>															
				<description>Main oscillator range select.</description>															
				<bitRange>[4:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>LOW</name>													
						<description>Low. The frequency range of the main oscillator is 1 MHz to 20 MHz.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>HIGH</name>													
						<description>High. The frequency range of the main oscillator is 15 MHz to 25 MHz.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>OSCEN</name>															
				<description>Main oscillator enable.</description>															
				<bitRange>[5:5]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. The main oscillator is disabled.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled.The main oscillator is enabled, and will start up if the correct external circuitry is connected to the XTAL1 and XTAL2 pins.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>OSCSTAT</name>															
				<description>Main oscillator status.</description>															
				<bitRange>[6:6]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>NOT_READY</name>													
						<description>Not ready. The main oscillator is not ready to be used as a clock source.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>READY</name>													
						<description>Ready. The main oscillator is ready to be used as a clock source. The main oscillator must be enabled via the OSCEN bit.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved. User software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:7]</bitRange>															
															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PCLKSEL0</name>																	
		<description>Peripheral Clock Selection register 0.</description>																	
		<addressOffset>0x1A8</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>PCLK_WDT</name>															
				<description>Peripheral clock selection for WDT.</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_TIMER0</name>															
				<description>Peripheral clock selection for TIMER0.</description>															
				<bitRange>[3:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_TIMER1</name>															
				<description>Peripheral clock selection for TIMER1.</description>															
				<bitRange>[5:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_UART0</name>															
				<description>Peripheral clock selection for UART0.</description>															
				<bitRange>[7:6]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_UART1</name>															
				<description>Peripheral clock selection for UART1.</description>															
				<bitRange>[9:8]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[11:10]</bitRange>															
															
