pyocd/pyOCD/pyocd/debug/svd/data/LPC176x5x_v0.2.svd
				</field>
				<field>
					<name>EPTXINTCLR2</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR3</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR4</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR5</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR6</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR7</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR8</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR9</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR10</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR11</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR12</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR13</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR14</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR15</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR16</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[16:16]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR17</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[17:17]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR18</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[18:18]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR19</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[19:19]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR20</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[20:20]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTCLR21</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Clear the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[21:21]</bitRange>
										
